In [8]:
!pip install pandas
import pandas as pd
import numpy as np

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in d:\anaconda\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
''' what is a Series? 
A Pandas Series is like a column in a tuple... 
It is a one-dimensional array holding data of any type.. '''  
s1 = pd.Series([23,24,25,12,32]) # Pd.Series always write S in Capital  
s1

0    23
1    24
2    25
3    12
4    32
dtype: int64

In [3]:
'''It is a one-dimensional array holding data of any type..'''
s1 = pd.Series([23,24,25,12,'32']) # Pd.Series always write S in Capital  
s1

0    23
1    24
2    25
3    12
4    32
dtype: object

In [4]:
s2 = pd.Series([23,45,67,12,34],index =["a","b","c","d","e"]) # here the abcd result indicate index series
s2

a    23
b    45
c    67
d    12
e    34
dtype: int64

In [5]:
s3 = pd.Series([23,45,67,12,34],index =["a","b","c","d","e"],dtype = 'float')
s3

a    23.0
b    45.0
c    67.0
d    12.0
e    34.0
dtype: float64

In [6]:
s4 = pd.Series({'e':65,'f':43,'c':45,})
s4  # here the dictinory key taken as index and value as tahen as value

e    65
f    43
c    45
dtype: int64

In [7]:
'''
what is DataFrame?
A pandas is a2 dimesional data structure, like a 2 dimenstional array, or a table with rows and columns

'''
d1 = pd.DataFrame([43,54,65,76]) # data taken here table format like rows and coluimns
d1

    0
0  43
1  54
2  65
3  76

In [9]:
d2 = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]])
d2

   0  1  2
0  2  3  4
1  4  5  6
2  1  2  3

In [10]:
# converting series in to dataframe
d2 = pd.DataFrame(s2)
d2

    0
a  23
b  45
c  67
d  12
e  34

In [11]:
d3 = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]], columns = ['a','b','c'])# change the column name  here 
d3

   a  b  c
0  2  3  4
1  4  5  6
2  1  2  3

In [12]:
d3 = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]], columns = ['a','b','c'], index=['x','y','z'])# change the indexing name  here 
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

In [13]:
dic = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20},{'ema':5,'dora':10,'alice':20}]
pd.DataFrame(dic,index=['a','b','c'])

   alex  joe  ema  dora  alice
a   1.0  2.0  NaN   NaN    NaN
b   NaN  NaN  5.0  10.0   20.0
c   NaN  NaN  5.0  10.0   20.0

In [14]:
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

In [15]:
print(d3['a'])
print(d3['b'])

x    2
y    4
z    1
Name: a, dtype: int64
x    3
y    5
z    2
Name: b, dtype: int64

In [17]:
d3['d']=d3['a']*d3['b']
d3['e']=d3['a']+d3['d']
d3

   a  b  c   d   e
x  2  3  4   6   8
y  4  5  6  20  24
z  1  2  3   2   3

In [18]:
pop = d3.pop('b')
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [19]:
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [20]:
del d3['d']

In [21]:
d3

   a  c   e
x  2  4   8
y  4  6  24
z  1  3   3

In [22]:
d3.pop('a')
d3

   c   e
x  4   8
y  6  24
z  3   3

In [23]:
d3.insert(1,'new1',d3['c']) #(loc,col,data)
d3

   c  new1   e
x  4     4   8
y  6     6  24
z  3     3   3

In [24]:
d={'c':1,'new1':33,'e':22}
df11 = d3.append(d,ignore_index = True)
df11

C:\Users\upend\AppData\Local\Temp\ipykernel_16972\321407726.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df11 = d3.append(d,ignore_index = True)

   c  new1   e
0  4     4   8
1  6     6  24
2  3     3   3
3  1    33  22

In [26]:
import numpy as np
d4 = pd.DataFrame({'abc':np.random.randint(2,6,size=(10)),'bcd':np.random.randint(4,10,size=(10)),'cde':np.random.randint(3,8,size=(10))})
d4

   abc  bcd  cde
0    3    4    4
1    3    4    4
2    2    5    5
3    4    8    4
4    4    8    3
5    2    4    7
6    5    8    7
7    2    6    3
8    3    9    7
9    4    5    6

In [28]:
d4.head()

   abc  bcd  cde
0    3    4    4
1    3    4    4
2    2    5    5
3    4    8    4
4    4    8    3

In [29]:
d4.tail()

   abc  bcd  cde
5    2    4    7
6    5    8    7
7    2    6    3
8    3    9    7
9    4    5    6

In [31]:
'''
Info About the data 
the dataframes object has a method called info(), that gives you m,ore information about the data set..

'''
d4.info()
d4.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

             abc        bcd        cde
count  10.000000  10.000000  10.000000
mean    3.200000   6.100000   5.000000
std     1.032796   1.969207   1.632993
min     2.000000   4.000000   3.000000
25%     2.250000   4.250000   4.000000
50%     3.000000   5.500000   4.500000
75%     4.000000   8.000000   6.750000
max     5.000000   9.000000   7.000000

In [32]:
d4

   abc  bcd  cde
0    3    4    4
1    3    4    4
2    2    5    5
3    4    8    4
4    4    8    3
5    2    4    7
6    5    8    7
7    2    6    3
8    3    9    7
9    4    5    6

In [33]:
d4.loc[9,'cde'] # loc[rowname,columnname]

6

In [34]:
d4.loc[4:9,['abc','cde']]

   abc  cde
4    4    3
5    2    7
6    5    7
7    2    3
8    3    7
9    4    6

In [35]:
d4.loc[[3,4,7],['abc','cde']]

   abc  cde
3    4    4
4    4    3
7    2    3

In [36]:
d4

   abc  bcd  cde
0    3    4    4
1    3    4    4
2    2    5    5
3    4    8    4
4    4    8    3
5    2    4    7
6    5    8    7
7    2    6    3
8    3    9    7
9    4    5    6

In [37]:
d4.iloc[9,2] # [row index, column index]

6

In [38]:
d4.iloc[2:7,[0,2]]

   abc  cde
2    2    5
3    4    4
4    4    3
5    2    7
6    5    7

In [39]:
d4

   abc  bcd  cde
0    3    4    4
1    3    4    4
2    2    5    5
3    4    8    4
4    4    8    3
5    2    4    7
6    5    8    7
7    2    6    3
8    3    9    7
9    4    5    6

In [40]:
d4.abc

0    3
1    3
2    2
3    4
4    4
5    2
6    5
7    2
8    3
9    4
Name: abc, dtype: int32

In [41]:
d4.abc.values # dataframe . column.values

array([3, 3, 2, 4, 4, 2, 5, 2, 3, 4])

In [42]:
d4['sub'] = d4.abc.values - d4.cde.values - d4.bcd.values
d4

   abc  bcd  cde  sub
0    3    4    4   -5
1    3    4    4   -5
2    2    5    5   -8
3    4    8    4   -8
4    4    8    3   -7
5    2    4    7   -9
6    5    8    7  -10
7    2    6    3   -7
8    3    9    7  -13
9    4    5    6   -7

In [44]:
a = [['rk',102,15000],['rama',103,20000],['krishna',104,250000]]
df1 = pd.DataFrame(a,columns =['name','id','salary'])
df1

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104  250000

In [45]:
y = df1[df1.salary>=20000]
print(y)
y[['id','salary']] # we only take list

      name   id  salary
1     rama  103   20000
2  krishna  104  250000

    id  salary
1  103   20000
2  104  250000

In [46]:
df1.append({'name':'sajan','id':105,'salary':30000},ignore_index = True)

C:\Users\upend\AppData\Local\Temp\ipykernel_16972\1584666616.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append({'name':'sajan','id':105,'salary':30000},ignore_index = True)

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104  250000
3    sajan  105   30000

In [47]:
df1 = df1.append({'name':np.nan,'id':105,'salary':30000},ignore_index = True)
df1

C:\Users\upend\AppData\Local\Temp\ipykernel_16972\3177088295.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append({'name':np.nan,'id':105,'salary':30000},ignore_index = True)

      name     id    salary
0       rk  102.0   15000.0
1     rama  103.0   20000.0
2  krishna  104.0  250000.0
3      NaN  105.0   30000.0

In [49]:
df1.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3   True  False   False

In [50]:
df1.isnull().sum()

name      1
id        0
salary    0
dtype: int64

In [51]:
df1.dropna()

      name     id    salary
0       rk  102.0   15000.0
1     rama  103.0   20000.0
2  krishna  104.0  250000.0

In [53]:
df1

      name     id    salary
0       rk  102.0   15000.0
1     rama  103.0   20000.0
2  krishna  104.0  250000.0
3      NaN  105.0   30000.0

In [54]:
df1.fillna(value='abc')

      name     id    salary
0       rk  102.0   15000.0
1     rama  103.0   20000.0
2  krishna  104.0  250000.0
3      abc  105.0   30000.0

In [55]:
df1

      name     id    salary
0       rk  102.0   15000.0
1     rama  103.0   20000.0
2  krishna  104.0  250000.0
3      NaN  105.0   30000.0

In [56]:
df1.drop([0],axis=0,inplace=True)
df1

      name     id    salary
1     rama  103.0   20000.0
2  krishna  104.0  250000.0
3      NaN  105.0   30000.0

In [57]:
df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon','Parrot', 'Parrot'],'Max Speed' : [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [58]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [60]:
# transpose
df.T

                0       1       2       3
Animal     Falcon  Falcon  Parrot  Parrot
Max Speed   380.0   370.0    24.0    26.0

In [62]:
import pandas as pd
emp ={"Name":["parker","smith","william","parker"],
 "age":[21, 32, 29, 21]}
info = pd.DataFrame(emp)
print(info)
print("------------------")
info = info.drop_duplicates()
print(info)

      Name  age
0   parker   21
1    smith   32
2  william   29
3   parker   21
------------------
      Name  age
0   parker   21
1    smith   32
2  william   29

In [64]:
import pandas as pd
def calc_sum(upender):
    return upender+1
data = {
    "x":[50, 40, 30],
    "y":[300, 1112, 42]

}
df = pd.DataFrame(data)
print(df)
x= df.apply(calc_sum)
print(x)

    x     y
0  50   300
1  40  1112
2  30    42
    x     y
0  51   301
1  41  1113
2  31    43